Revit 2027 API
FabricationPartSizeMap.Depth Property
 The depth of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Depth { get; set; }
Public Property Depth As Double
	Get
	Set
public:
property double Depth {
	double get ();
	void set (double value);
}
member Depth : float with get, set
Property Value
Double
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace